{"_id":{"$oid":"5bf055325baa15266c5cfb0c"},"title":"M187 Mini Wireless Mouse (Black)","slug":"m187-mini-wireless-mouse-(black)","desc":"The pocket-size mouse that's big on wireless reliability.Goes wherever you goYou can take the Mini Mouse wherever you take your laptop-thanks to its pocket-ready, extra-small design.Free yourselfThe tiny nano receiver stays in your USB port-and lets you enjoy the freedom of wireless with more precision and control than your laptop's touchpad.Confident connectionEnjoy the reliability of a cord with the convenience of wireless-thanks to Logitech Advanced 2.4 GHz wireless technology.\r\n\r\n","price":24.99,"category":"electronic-accessories","image":"mouse.jpg","flag":"true","__v":0}
{"_id":{"$oid":"5bf055f75baa15266c5cfb0d"},"title":"Apple 12-inch Macbook : 1.3GHz dual-core Intel Core i5, 512GB- Rose Gold","slug":"apple-12-inch-macbook-:-1.3ghz-dual-core-intel-core-i5,-512gb--rose-gold","desc":"1.3 GHz Intel Core i5 Dual-Core\r\n8GB of 1866MHz LPDDR3 RAM | 512GB SSD\r\nIntegrated Intel HD Graphics 615\r\n12\" 2304 x 1440 IPS Display\r\nUSB 3.0 Type-C Port\r\n802.11ac Wi-Fi | Bluetooth 4.2\r\nForce Touch Trackpad\r\nStereo Speakers | Dual Mics\r\nSlim, Compact Design\r\nmacOS Sierra\r\n","price":1549,"category":"laptops","image":"macbook.jpg","flag":"true","__v":0}
{"_id":{"$oid":"5bf056ae5baa15266c5cfb0e"},"title":"Microsoft Surface Pro 6 i5/8/256GB - Black","slug":"microsoft-surface-pro-6-i5/8/256gb---black","desc":"Features: 12.3 inch PixelSense Display - Resolution 2736x1824 (267 PPI) - Aspect Ratio 3:2 - 10 point multi-touch; Intel Core i5 8350U (8th Gen) Processor (QC, 1.7GHz/3.6GHz); 8GB LPDDR3 SDRAM; 128GB SSD PCle - NVMe; 5.0MP Front-Facing and 8.0MP Rear-Facing Camera with 1080p; Intel UHD Graphics 620; Dolby Audio Premium; 802.11a/b/g/n/ac Wi-Fi Wireless Networking Compatible with Bluetooth 4.1 Wireless Technology; Trusted Platform Module (TPM 2.0) Security Chip; 44 Watt Battery for up to 13.5 Hours of Run Time. Interfaces: USB 3.0/Mini DisplayPort/Headphone-Microphone Combo Jack/Dock/SurfaceConnect/3-in-1 Memory Card Reader. Limited warranty - advanced exchange program - 1 year (delivery and returns charges by manufacturer). Windows 10 Pro 64-bit Operating System","price":1189,"category":"laptops","image":"MS.jpg","flag":"true","__v":0}
{"_id":{"$oid":"5bf0574c5baa15266c5cfb0f"},"title":"ESET Smart Security Home Edition 1 User 1 Year (Electronic Software Delivery)","slug":"eset-smart-security-home-edition-1-user-1-year-(electronic-software-delivery)","desc":"Securing Your Online Life\r\n\r\nPlease Note: Once the order has been processed, this product is nonreturnable.\r\nPRODUCT HIGHLIGHTS\r\n\r\nStay Safe from Viruses and Spyware\r\nBank and Shop Safely\r\nBalanced Security and Privacy\r\nKeep Kids Safe Online\r\nSafeguards Data\r\nOut-of-Home Network Protection\r\nDevice Control\r\nRansomware Shield\r\nPersonal Firewall\r\nWindows Compatible\r\nInternet Security 2017 from ESET is designed to safeguard Windows systems from malware, viruses, and more. This downloadable software program provides proactive protection from online as well as offline threats by checking web browsers, PDF readers, Java-based programs, and other applications for malicious attacks. To utilize a minimum amount of system resources, it enters into Silent Mode when an active program is running and downloads small-sized update packages. The purchase of this product provides you with a 1-year subscription to updates and supports a single user.\r\n\r\nInternet Security 2017 lets you keep your children safe from online dangers with Parental Control tools, which give you predefined categories based upon the age of your kids. You can also create a password to prevent unwanted setting changes as well as product uninstallation.\r\n\r\nAside from child protection, Internet Security 2017 offers a secured web browser to safely pay online as well as a keylogging prevention feature that encrypts communications between the keyboard and browser. When connecting at a public network, it can switch to a Strict Protection mode and make your device invisible to other systems. For securing your private files, you may set up Internet Security 2017 to block the system from accessing storage media. Moreover, Ransomware Shield is available to block malware that locks your data and requires payment to unlock it.\r\n\r\nInternet Safety\r\nAnti-Virus and Anti-Spyware\r\n\r\nProvides proactive protection against all types of online and offline threats and prevents malware spreading to other users.\r\nExploit Blocker\r\n\r\nBlocks attacks specifically designed to evade antivirus detection and eliminates lockscreens and ransomware.\r\nProtects against attacks on web browsers, PDF readers, and other applications, including Java-based software.\r\nAdvanced Memory Scanner\r\n\r\nEnables improved detection of persistent malware that employs multiple layers of encryption to conceal its activity.\r\nCloud-Powered Scanning\r\n\r\nSpeeds up scans by whitelisting safe files based on the ESET Live Grid file reputation database.\r\nHelps to proactively stop unknown malware based on its behavior, by comparing it with a cloud-based reputation system.\r\nScan While Downloading Files\r\n\r\nDecreases scanning time by scanning specific file types — such as archives — during the download process.\r\nIdle-State Scanning\r\n\r\nAids system performance by performing in-depth scans when your computer is not in use.\r\nHelps detect potential inactive threats before they can cause damage.\r\nHost-Based Intrusion Prevention System (HIPS)\r\n\r\nLets you customize the behavior of the system in great detail.\r\nGives you the option to specify rules for system registry, active processes, and programs as well as fine-tune your security posture.\r\nScript-Based Attack Protection\r\n\r\nDetects attacks by malicious scripts that try to exploit Windows PowerShell.\r\nAlso detects malicious JavaScripts that can attack via your browser.\r\nFull Power for Your Computer\r\nSmall System Footprint\r\n\r\nMaintains high performance and extends the lifetime of hardware.\r\nFits virtually any type of system environment.\r\nSaves Internet bandwidth with small update packages.\r\nGamer Mode\r\n\r\nESET Internet Security automatically switches to silent mode if a program is running in full-screen.\r\nSystem updates and notifications are postponed to save resources for gaming, video, photos, or presentations.\r\nPortable Computer Support\r\n\r\nPostpones all non-actionable pop-up windows, updates, and system-hungry activities to preserve system resources so that you can stay online and unplugged longer.\r\nProtect Your Privacy\r\nRansomware Shield\r\n\r\nBlocks malware that tries to lock you out of your personal data and then asks you to pay a 'ransom' to unlock it.\r\nWebcam Protection\r\n\r\nConstantly monitors all the processes and applications running on your computer, to see which ones want to use your webcam. It alerts you to any unauthorized access your webcam, and lets you block them.\r\n\r\nHome Network Protection\r\n\r\nProvides extra security for your home Wi-Fi router by testing the router for vulnerabilities, such as weak password or out-of-date firmware, and offers you options for remediation. To show you who's connected, it provides an easy-to-access list of connected devices, which are categorized by type (e.g. smartphone and IoT devices).\r\n\r\nPersonal Firewall\r\n\r\nPrevents unauthorized access to your computer and misuse of your personal data.\r\nNetwork Attack Protection\r\n\r\nIn addition to Personal Firewall, automatically protects your computer from malicious network traffic, blocking threats revealed by dangerous traffic patterns.\r\nBanking \u0026 Payment Protection\r\n\r\nFeatures a unique secured browser through which you can safely pay online.\r\nAutomatically protects you on online banking sites.\r\nProtects from keyloggers by encrypting communications between the keyboard and the browser for safer transactions.\r\nBotnet Protection\r\n\r\nAdded layer of security that protects against botnet malware — preventing your computer from being misused for spam and network attacks.\r\nBenefit from a new type of detection, thanks to Network Signatures, for even faster blocking of malicious traffic.\r\nAnti-Phishing\r\n\r\nProtects you from attempts to acquire sensitive information such as usernames, passwords, or other sensitive personal details by fake websites masquerading as trustworthy ones.\r\nOut-of-Home Network\r\n\r\nAlerts you when connecting to an unknown network and prompts you to switch to a Strict Protection mode.\r\nMakes your device invisible to other computers connected to the same network.\r\nDevice Control\r\n\r\nAllows you to prevent unauthorized copying of your private data to an external device.\r\nBlocks storage media: CDs, DVDs, USB sticks, and disk storage devices.\r\nLets you block devices connecting via Bluetooth as well as FireWire, serial, and parallel ports.\r\nAntispam\r\n\r\nKeeps unwanted emails from clogging your mailbox.\r\nKid Protection\r\nParental Control\r\n\r\nGives you the option to choose from predefined categories according to the age of your kids.\r\nLets you set a password to protect settings against modification as well as prevent unauthorized product uninstallation.\r\nEasy Set Up\r\nOne-Click Solution\r\n\r\nProtection status and all frequently used actions and tools are accessible from all screens.\r\nIn case of any security alerts, quickly find the solution in one click.\r\nSmooth Product Upgrades\r\n\r\nBenefit from new protection technologies as soon as they become available for a continuously high level of security.\r\nSettings for Advanced Users\r\n\r\nOffers in-depth security settings to fit your needs.\r\nAllows you to define maximum scanning depth, scanning time, size of the scanned files and archives, and more.\r\nESET SysInspector\r\n\r\nAn advanced diagnostic tool that captures critical information from the system to troubleshoot a broad range of security and compatibility issues.","price":59.99,"category":"antivirus-and-security","image":"eset.jpg","flag":"true","__v":0}
{"_id":{"$oid":"5bf057c95baa15266c5cfb10"},"title":"Apple Watch Series 4 GPS, 40mm Silver Aluminum Case with White Sport Band","slug":"apple-watch-series-4-gps,-40mm-silver-aluminum-case-with-white-sport-band","desc":"Series 4 (GPS) Features\r\nSpace Gray aluminum case\r\nBuilt-in GPS, GLONASS, Galileo, and QZSS\r\nS4 with 64-bit dual-core processor\r\nW3 Apple wireless chip\r\nBarometric altimeter\r\nCapacity 16GB1\r\nOptical heart sensor\r\nElectrical heart sensor\r\nImproved accelerometer up to 32 g‑forces\r\nImproved gyroscope\r\nAmbient light sensor\r\nLTPO OLED Retina display with Force Touch (1000 nits)\r\nDigital Crown with haptic feedback\r\nLouder speaker\r\nIon-X strengthened glass\r\nSapphire crystal and ceramic back\r\nWi-Fi (802.11b/g/n 2.4GHz)\r\nBluetooth 5.0\r\nBuilt-in rechargeable lithium-ion battery\r\nUp to 18 hours of battery life2\r\nWater resistant 50 meter","price":393,"category":"electronic-accessories","image":"Apple Watch.jpg","flag":"true","__v":0}
{"_id":{"$oid":"5bf0584f5baa15266c5cfb11"},"title":"OnePlus 6T","slug":"oneplus-6t","desc":"Features\r\nOnePlus 6T\r\n\r\nThe OnePlus 6T balances proven features, focusing on speed and smoothness, to set a new industry standard. It’s built for a premium experience, with a cutting-edge in-display fingerprint sensor, Fast Charge technology, and dual cameras that nail every detail night or day.\r\nIn-screen fingerprint sensor\r\nSeamless design that feels comfortable in hand\r\nCorning® Gorilla® Glass 6\r\nCustom display options like Reading Mode\r\n16 + 20MP dual cameras\r\nIntelligent Scene Recognition\r\nNightscape technology for amazing night shots\r\nSuper slow-mo video at 480 frames per second\r\n8GB RAM\r\nQualcomm® Snapdragon™ 845\r\n3,700 mAh all-day battery\r\nFast Charge technology\r\nImproved water and dust resistance\r\nOxygenOS - powered by Android P\r\nFace Unlock\r\nImproved gesture controls","price":580,"category":"mobile-devices","image":"OnePlus-6T.jpg","flag":"true","__v":0}
